// © Copyright 2011-2013, 2015 HP Development Company, L.P.

TaskName = "Wireless Setup";
TaskTOCTitle = "HP Auto Wireless Connect";
ConfirmSettingsTaskName = "Confirm HP Auto Wireless Connect";
ConfirmSettingsTaskTOCTitle = "Confirm Wireless Settings";
NetworkSelectTaskName = "Select Network";
DeviceDiscoveryTaskName = "Select Device";
DeviceDiscoveryTaskTitle = "Select device to configure";
ConfigureSettingsTaskName = "Configuring Device";
ResultsTaskName = "Configuration Results";

// confirmation pane
ConfirmationDescriptionText = "If you choose to use HP Auto Wireless Connect your computer will temporarily disconnect from your wireless network, so you should complete any downloads/uploads already in progress. This interruption should last about thirty seconds and then your wireless connection will be restored.";
HostNetworkDetectedTitle = "The application has determined that your computer is connected to a wireless network with the following settings:";
WirelessNetworkNameTitle = "Wireless Network Name:";
CommunicationModeTitle = "Communication Mode:";
EncryptionTypeTitle = "Encryption Type:";

WirelessNetworkChooseTitle = "Do you want your device to be configured to use the above settings?";
KeepCurrentNetworkSettingsTitle = "Yes, keep these settings.";
ChooseAnotherNetworkSettingsTitle = "No, I want to choose another network.";

// network selection pane
NetworkSelectTitle = "Select your wireless network name from the list below.";
SelectedNetworkPasswordTitle = "Password:";
NetworkSelectContinueDescription= "Click continue to add the device to \"%@\".";
NetworkDiscoveryFailedTitle = "Network discovery failed";
NetworkDiscoveryFailedDescription = "No wireless networks can be discovered.";
SetupNetworkSelectedTitle = "Select another network";
SetupNetworkSelectedDescription = "You are trying to connect to a special network that was created by a printing device. Click OK and select a different network.";

NetworkNotAvailableTitle = "Network Unavailable";
DeviceNetworkNotAvailableMessageFormat = "The device could not access the wireless network \"%@\". Please make sure your Wireless Access point is working correctly and is in range of your device, or choose another network.";
MacNetworkNotAvailableMessageFormat = "The mac could not access the wireless network \"%@\". Please make sure your Wireless Access point is working correctly and is in range of your mac, or choose another network.";
ChangeNetworkButtonTitle= "Change Network";

LookingForNetworkMessageFormat = "Looking for Network: \"%@\".";

UnsupportedNetworkTitle = "Unsupported Network";
UnsupportedNetworkMessageFormat = "Please choose another network or contact your network administrator for assistance.";

EnterpriseNetworkAlertTitle = "Enterprise network selected";
EnterpriseNetworkAlertForUSBConnectionMessage = "This network is secured using a type of enterprise encryption. Connect the printer to the same network that your computer is connected to and then use the embedded web server, or contact your administrator.";
EnterpriseNetworkAlertForNetworkConnectionMessage = "This network is secured using a type of enterprise encryption. To connect the printer to the network, use the embedded web server (EWS) or contact your administrator. If you choose to use EWS, your computer will disconnect from your wireless network and connect to a special network created by the printer.";
ConfigureUsingEWSButtonTitle = "Configure Using EWS";
ConnectingToDeviceProgressTitle = "Connecting to device network...";

UnableToConnectToDeviceNetworkAlertMessage = "Make sure your device is within view of this computer and that the blue indicator light on the device is blinking to show that it is in HP Auto Wireless Connect mode. You can reset this mode using the Restore Network Defaults option on the device’s control panel. Refer to your device’s documentation for instructions on how to do this.";

// select device
DeviceNameColumnTitle = "Device Name";
DeviceModelColumnTitle = "Device Model";
DevicesFilterLabel = "Devices:";
AllFilterTitle = "All";
SupportedDevicesFilterTitle = "Supported";

// configure
ConfigureTaskName = "Configuring Your HP Device";
ConfigureTitle = "Configuring…";
NoteTitle = "Your HP device is being configured to join the selected wireless network. This may take a few minutes.";
RestoringNetworkSettings = "Restoring Network Settings...";

// particular errors
IncorrectPasswordTitle = "Password Not Accepted";
IncorrectPasswordDescription = "The password was not accepted by the wireless network \"%@\".\n\nPlease re-enter the password.";

DuplicateNetworkNameErrorTitle = "Duplicate WiFi Networks Names";
DuplicateNetworkNameErrorDescription = "Duplicate \"%@\" WiFi networks detected. Please check your wireless router settings.";

MacAddressFilterErrorTitle = "WiFi Filter Error";
MacAddressFilterErrorDescription = "The Device MAC Hardware Address has been filtered out and not available from \"%@\". Please check your wireless router settings.";

WeakSignalStrengthErrorTitle = "Weak Signal Strength";
WeakSignalStrengthErrorDescription = "The \"%@\" wireless router signal strength is weak. Please place the device closer to the router.";

DeviceNotReachableErrorTitle = "Device Not Reachable";
DeviceNotReachableErrorDescription = "The wireless network settings were successfully downloaded to your device. However, your Mac was unable to locate the device on the network.\n\nPlease make sure that:\n• Your Mac is connected to a wired or wireless network that has access to your device.\n• Your device is connected to the wireless network \"%@\".";

EmptyPasswordError = "Password is required.";
TooShortWPAPersonalPasswordError = "Password must be at least 8 characters.";
TooLongWPAPersonalPasswordError = "Password cannot be longer than 64 characters.";

// restore original network errors

FailedToRestoreOriginalNetworkErrorTitle = "Cannot restore connection to your original wireless network";

NoPasswordIsStoredInKeychainErrorMessageFormat = "The assistant was not able to retrieve credentials for the wireless network \"%@\" from your keychain. Make sure your Mac is connected to a wired or wireless network that has access to your device.";
PasswordFromKeychainNotAcceptedErrorMessageFormat = "Your credentials were not accepted by the wireless network \"%@\". Make sure your Mac is connected to a wired or wireless network that has access to your device.";
FailedToRestoreOriginalNetworkGenericErrorMessage = "Make sure your wireless access point is working correctly and is in range of your Mac, and then try to establish connection manually.";

// results
ManualNetworkConfigurationTitle = "Manual";
AutoNetworkConfigurationTitle = "Auto";
LinklocalNetworkConfigurationTitle = "Link-local";
NetworkSettingsTitle = "Network settings";
ConfigurationFailedTaskName = "Configuration Failed";
ConfigurationCompleteTaskName = "Configuration Complete";
ConfigurationFailedTitle = "The assistant was not able to configure your device using a wireless connection.";
ConfigurationSucceededTitle = "Your HP device is now configured correctly and has joined \"%@\" network.";

ConfigurationFailedNote = "Make sure the wireless access point is working correctly and that your device is located within range of it and is turned on but idle, and then click Retry to make another attempt.\n\n%@";
UnableToConnectToDeviceNetworkUSBSOWMessage = "Make sure your device is turned on and is within view of this computer, and then click Retry to make another attempt. The blue indicator light on your device should be blinking to show that the device is in HP Auto Wireless Connect mode. After the device is first turned on during installation, it will remain in this mode for up to one hour until it is connected to a network.\n\n%@";
UnableToConnectToDeviceNetworkFPWithoutIndicatorSOWMessage = "Make sure your device is within view of this computer and that the device is in HP Auto Wireless Connect mode. Then click Retry to make another attempt. You can reset HP Auto Wireless Connect mode using the Restore Network Defaults option on the device’s control panel. Refer to your device’s documentation for instructions on how to do this.\n\n%@";
UnableToConnectToDeviceNetworkFPWithIndicatorSOWMessage = "Make sure your device is within view of this computer and that the blue indicator light on the device is blinking to show that it is in HP Auto Wireless Connect mode. Then click Retry to make another attempt. You can reset HP Auto Wireless Connect mode using the Restore Network Defaults option on the device’s control panel. Refer to your device’s documentation for instructions on how to do this.\n\n%@";
ConfigurationFailedUSBSOWPart = "Alternatively, you can configure your device by connecting it to this computer with a USB cable and then clicking Retry. When the device is configured to join the network you selected earlier, you can disconnect it from the computer.";
ConfigurationFailedFPSOWPart = "Alternatively, you can configure your device to connect to your wireless network using the Wireless Setup Wizard, which is accessible from the device's control panel. To do that, follow these steps:
       1. Press the Wireless button or tap the Wireless icon on your device.
       2. On the device's display, open the Wireless status screen and select Settings.
       3. Select Wireless Setup Wizard and follow the onscreen instructions.


Once you have successfully completed the wizard, your device will connect to the network automatically.";

ConfigurationOverUSBFailedTitle = "The assistant was not able to configure your device using a USB connection.";
ConfigurationOverUSBFailedNote = "Make sure the wireless access point is working correctly and that your device is located within range of it and is turned on but idle, and then click Retry to make another attempt.";
MoreInfoText = "For more information online, visit";
FailedTitle = "Failed to retrieve network information";
BonjourServiceNameLabel = "Bonjour Service Name:";
IPAddress = "IP address:";
AddressMode = "Address Mode:";
SubnetMask = "Subnet Mask:";
DefaultGateway = "Default Gateway:";
HostName = "Host Name:";
PrefixLength = "Prefix Length:";
DisconnectUSBWarningText = "<b>Important:</b> Please disconnect the USB cable connected to your device now.";
DeviceNotLocatedWarningText = "The wireless network settings were successfully downloaded to your device. However your Mac was unable to locate the device on the network.";

// network settings
Adhoc = "Adhoc";
Infrastructure = "Infrastructure";

// select network
NetworkColumnTitle = "Network";
SignalStrengthColumnTitle = "Signal Strength";
EncryptionColumnTitle = "Encryption";
ModeColumnTitle = "Mode";
